Revit 2024 API
Camera.Transform Method
 Transforms the camera
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void Transform(
	Transform trf
)
Visual Basic
Public Sub Transform ( _
	trf As Transform _
)
Visual C++
public:
void Transform(
	Transform^ trf
)
Parameters
trf
Type: Autodesk.Revit.DB.Transform
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace